ConnectTest/src/Enums/SmsProviders/SmsProviders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SmsProviders</name>
  <enumValues>
    <name>Devino</name>
  </enumValues>
  <enumValues>
    <name>IDigital</name>
  </enumValues>
  <enumValues>
    <name>IDMkg</name>
    <comment>IDM.KG </comment>
  </enumValues>
  <enumValues>
    <name>Megalab</name>
  </enumValues>
  <enumValues>
    <name>MTSComminicator</name>
  </enumValues>
  <enumValues>
    <name>Prontosms</name>
  </enumValues>
  <enumValues>
    <name>Rapporto</name>
  </enumValues>
  <enumValues>
    <name>Smsc</name>
  </enumValues>
  <enumValues>
    <name>SmsGold</name>
  </enumValues>
  <enumValues>
    <name>Smstraffic</name>
  </enumValues>
  <enumValues>
    <name>Stramedia</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Enums/messageStatuses/messageStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>messageStatuses</name>
	<enumValues>
		<name>sent</name>
	</enumValues>
	<enumValues>
		<name>notSent</name>
	</enumValues>
	<enumValues>
		<name>delivered</name>
	</enumValues>
	<enumValues>
		<name>notDelivered</name>
	</enumValues>
	<enumValues>
		<name>read</name>
	</enumValues>
	<enumValues>
		<name>undefined</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/Enums/JSONValueTypes/JSONValueTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>JSONValueTypes</name>
	<enumValues>
		<name>string</name>
	</enumValues>
	<enumValues>
		<name>number</name>
	</enumValues>
	<enumValues>
		<name>date</name>
	</enumValues>
	<enumValues>
		<name>boolean</name>
	</enumValues>
	<enumValues>
		<name>structure</name>
	</enumValues>
	<enumValues>
		<name>array</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/Enums/informationChannels/informationChannels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>informationChannels</name>
  <enumValues>
    <name>pushEmployee</name>
  </enumValues>
  <enumValues>
    <name>pushCustomer</name>
  </enumValues>
  <enumValues>
    <name>sms</name>
  </enumValues>
  <enumValues>
    <name>email</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Catalogs/messages/messages.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>messages</name>
  <attributes>
    <name>action</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>appType</name>
    <type>
      <types>EnumRef.appTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>gym</name>
    <type>
      <types>CatalogRef.gyms</types>
    </type>
  </attributes>
  <attributes>
    <name>holding</name>
    <type>
      <types>CatalogRef.holdings</types>
    </type>
  </attributes>
  <attributes>
    <name>objectId</name>
    <comment>Идентификатор документа/рассылки, по которому отправлено
			сообщение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>objectType</name>
    <comment>Идентификатор документа/рассылки, по которому отправлено
			сообщение</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>phone</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>priority</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>registrationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>text</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>title</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>token</name>
    <type>
      <types>CatalogRef.tokens</types>
    </type>
  </attributes>
  <attributes>
    <name>user</name>
    <comment>Определяется если пользователь зарегистирован в МП</comment>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </attributes>
  <tabularSections>
    <name>channelPriorities</name>
    <attributes>
      <name>channel</name>
      <type>
        <types>EnumRef.informationChannels</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ConnectTest/src/CommonModules/SmsMegalab/Module.bsl
Function sendSMS(parameters, answer) Export
	
	JSONValue = New Structure;
	JSONValue.Insert("from"	, XMLString(parameters.senderName));
	JSONValue.Insert("to"		, Number(parameters.phone));
	JSONValue.Insert("message"	, XMLString(parameters.text));
	
	callback_url = Messages.GetMessageCallbackURL(Enums.SmsProviders.Megalab);
	If  callback_url <> "" Then
		JSONValue.Insert("callback_url"	, XMLString(callback_url));
	EndIf;
	
	JSONWriter	= New JSONWriter;
	JSONWriter.SetString();
	WriteJSON(JSONWriter, JSONValue);
	
	JSONString = JSONWriter.Закрыть();
	
	ssl = ?(parameters.secureConnection, New OpenSSLSecureConnection(), Undefined);
	ConnectionHTTP = New HTTPConnection(parameters.server, parameters.port, , , , 60, ssl);
	
	Headers = New Map;
	Headers.insert("Authorization", "Basic " + Crypto.EncryptBase64(parameters.user+":"+parameters.password, "US-ASCII"));
	Headers.insert("Content-Type", "application/json");
	
	requestHTTP = New HTTPRequest("/sms/v1/sms", Headers);
	requestHTTP.SetBodyFromString(JSONString, TextEncoding.UTF8, ByteOrderMarkUsage.DontUse);
	
	answerBody = ConnectionHTTP.Post(requestHTTP);
	JSONStructure = "";
	
	If answerBody.КодСостояния = 200 Then 
		JSONReader	= Новый JSONReader;
		JSONReader.SetString(answerBody.GetBodyAsString());
		JSONStructure	= ReadJSON(JSONReader);
		JSONReader.Закрыть();
		
		If JSONStructure.result.status.code = 0 Then 
			answer.Insert("id", JSONStructure.result.msg_id);
			answer.Insert("messageStatus", Enums.messageStatuses.sent);
		Else
			answer.Insert("error", JSONStructure.result.status.description);
		EndIf;
	Else
		answer.Insert("error", "Сбой при отрправке Messages 500 Internal Error");
	Endif;
	
	answer.Insert("period", ToUniversalTime(CurrentDate()));
	AnswerResponseBodyForLogs = Messages.GetAnswerResponseBodyForLogs(Headers, JSONString, JSONStructure);
	answer.Insert("AnswerResponseBodyForLogs", AnswerResponseBodyForLogs);
	
	Return answer;
	
EndFunction

Function checkSmsStatus (Request) Export

	RequestParameters = HTTP.decodeJSON(request.GetBodyAsString(), Enums.JSONValueTypes.structure, , False);

	If RequestParameters.Property("msg_id") Then
		
		messageParameters = Messages.FindMessageById(RequestParameters.msg_id);
		
		If messageParameters.messageRef <> Catalogs.messages.EmptyRef() Then
			
			parameters = New Structure("message, nodeMessagesToCheckStatus, messageAge", messageParameters.messageRef, GeneralReuse.nodeMessagesToCheckStatus(Enums.informationChannels.sms), messageParameters.messageAge);
			answer = New Structure("messageStatus, error, period", Enums.messageStatuses.notDelivered, "", Undefined);
			
			If RequestParameters.status = "delivered" Then
				answer.messageStatus = Enums.messageStatuses.delivered;
			Else
				answer.messageStatus = Enums.messageStatuses.notDelivered;
			EndIf;
			
			answer.period = ToUniversalTime(CurrentDate());
			
			Messages.checkSmsStatusContinuation(answer, parameters) ; 
			
			Return New HTTPServiceResponse (200);
		Else
			Return New HTTPServiceResponse(500);
		Endif
	Else
		Return New HTTPServiceResponse(500);
	Endif
EndFunction
